In [ ]:
import numpy as np
import pandas as pd
# Series: a one-dimensional labeled array holding data of any type
# such as integers, strings, Python objects etc.

# DataFrame: a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [33]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
# 以下代码使用 pandas 库创建一个 DataFrame 对象
# pd.DataFrame 是 pandas 中用于创建数据框的函数
# np.random.randn(6,4) 使用 numpy 库生成一个 6 行 4 列的二维数组，数组中的元素是从标准正态分布中随机采样得到的
# index = dates 指定数据框的行索引为变量 dates，这里的 dates 应该是一个预先定义好的索引对象
# columns=list("ABCD") 指定数据框的列名分别为 'A', 'B', 'C', 'D'
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns=list("ABCD"))
# 下面这个是生成均匀分布的例子
DF = pd.DataFrame(np.random.rand(6,4),index=dates,columns=list("ABCD"))
df
#DF

                   A         B         C         D
2013-01-01  0.492442 -0.660848  1.325014 -0.134426
2013-01-02  1.291120 -0.269870 -1.241519 -0.804308
2013-01-03 -0.081053  1.601045 -0.137919 -1.039423
2013-01-04 -0.851981 -0.037322 -2.100062 -0.677439
2013-01-05  0.613908  0.711906 -0.387672  1.449137
2013-01-06  0.677387 -0.292343  0.500383  0.871884

In [35]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20180101"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4,dtype="int32"),
        "E": pd.Categorical(["test","train","test","train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2018-01-01  1.0  3   test  foo
1  1.0 2018-01-01  1.0  3  train  foo
2  1.0 2018-01-01  1.0  3   test  foo
3  1.0 2018-01-01  1.0  3  train  foo

In [36]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [ ]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [44]:
df.head()

                   A         B         C         D
2013-01-01  0.492442 -0.660848  1.325014 -0.134426
2013-01-02  1.291120 -0.269870 -1.241519 -0.804308
2013-01-03 -0.081053  1.601045 -0.137919 -1.039423
2013-01-04 -0.851981 -0.037322 -2.100062 -0.677439
2013-01-05  0.613908  0.711906 -0.387672  1.449137

In [46]:
df.tail(4)

                   A         B         C         D
2013-01-03 -0.081053  1.601045 -0.137919 -1.039423
2013-01-04 -0.851981 -0.037322 -2.100062 -0.677439
2013-01-05  0.613908  0.711906 -0.387672  1.449137
2013-01-06  0.677387 -0.292343  0.500383  0.871884

In [47]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
df.to_numpy()

array([[ 0.49244183, -0.6608481 ,  1.32501434, -0.13442573],
       [ 1.29112036, -0.26986998, -1.24151946, -0.80430779],
       [-0.08105268,  1.60104517, -0.13791942, -1.0394234 ],
       [-0.85198113, -0.03732231, -2.10006187, -0.67743886],
       [ 0.61390834,  0.71190586, -0.3876721 ,  1.44913724],
       [ 0.67738706, -0.2923432 ,  0.50038344,  0.87188372]])

In [49]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [51]:
df.describe()
# mean是平均值
# std是标准差

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.356971  0.175428 -0.340296 -0.055762
std    0.736628  0.834495  1.219195  1.004572
min   -0.851981 -0.660848 -2.100062 -1.039423
25%    0.062321 -0.286725 -1.028058 -0.772591
50%    0.553175 -0.153596 -0.262796 -0.405932
75%    0.661517  0.524599  0.340808  0.620306
max    1.291120  1.601045  1.325014  1.449137

In [52]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.492442    1.291120   -0.081053   -0.851981    0.613908    0.677387
B   -0.660848   -0.269870    1.601045   -0.037322    0.711906   -0.292343
C    1.325014   -1.241519   -0.137919   -2.100062   -0.387672    0.500383
D   -0.134426   -0.804308   -1.039423   -0.677439    1.449137    0.871884

In [53]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.134426  1.325014 -0.660848  0.492442
2013-01-02 -0.804308 -1.241519 -0.269870  1.291120
2013-01-03 -1.039423 -0.137919  1.601045 -0.081053
2013-01-04 -0.677439 -2.100062 -0.037322 -0.851981
2013-01-05  1.449137 -0.387672  0.711906  0.613908
2013-01-06  0.871884  0.500383 -0.292343  0.677387

In [54]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.492442 -0.660848  1.325014 -0.134426
2013-01-06  0.677387 -0.292343  0.500383  0.871884
2013-01-02  1.291120 -0.269870 -1.241519 -0.804308
2013-01-04 -0.851981 -0.037322 -2.100062 -0.677439
2013-01-05  0.613908  0.711906 -0.387672  1.449137
2013-01-03 -0.081053  1.601045 -0.137919 -1.039423

In [55]:
df[0:3]

                   A         B         C         D
2013-01-01  0.492442 -0.660848  1.325014 -0.134426
2013-01-02  1.291120 -0.269870 -1.241519 -0.804308
2013-01-03 -0.081053  1.601045 -0.137919 -1.039423

In [56]:
df.loc[dates[0]]

A    0.492442
B   -0.660848
C    1.325014
D   -0.134426
Name: 2013-01-01 00:00:00, dtype: float64

In [57]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.492442 -0.660848
2013-01-02  1.291120 -0.269870
2013-01-03 -0.081053  1.601045
2013-01-04 -0.851981 -0.037322
2013-01-05  0.613908  0.711906
2013-01-06  0.677387 -0.292343

In [58]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.291120 -0.269870
2013-01-03 -0.081053  1.601045
2013-01-04 -0.851981 -0.037322

In [59]:
df.at[dates[0], "A"]

0.4924418305199361

In [60]:
df.iloc[3]

A   -0.851981
B   -0.037322
C   -2.100062
D   -0.677439
Name: 2013-01-04 00:00:00, dtype: float64